export const state = {
    BroadcastAnnouncement:{},
    announcement:{
      announcement1:{
        checked:false,
        content:[
          {
            title:'一、遵守會員規範及法律規定：',
            content:'您瞭解您註冊成為會員後，即可使用本遊戲所提供之各項服務(以下稱本遊戲)。當會員使用本遊戲時，即表示除了同意遵守本遊戲條款外，還同意接受本遊戲對會員規範(包括各項遊戲規則、球賽投注規則、公告及注意事項等)及相關法令規定之拘束，本遊戲所有產品與客戶服務、軟件系統、網絡架構等相關業務事宜，使用本遊戲之會員請遵守使用者當地法令之許可，如有違反之情事恕非本遊戲之負責範圍。'
          },
          {
            title:'二、服務簡介：',
            content:'(一) 本遊戲旨在創造一個『安全可靠』、『即時便利』、『公平公正』、『專業營運』的優質娛樂服務平台，強調的是讓會員不受時空的限制，隨時上線就可以參與一個公平公正的遊戲，亦可以享受到與世界各地玩家切磋的樂趣，我們秉持以客為尊的態度，不斷開發創新及了解客戶需求是本遊戲引以為傲的經營理念，冀望能創造出嶄新的娛樂價值以及達到多方普及的目的，成為具有領導指標性的娛樂網站。'
          },
          {
            title:'三、真實登錄義務：',
            content:'基於本遊戲所提供之各項服務，您同意於註冊時依註冊申請程序所提示之項目，登錄您本人正確、真實及完整之個人資料；當您的個人資料有異動時，請立即更新，以維持您個人資料之正確、真實及完整。如因您登錄不實資料或冒用他人名義以致於侵害他人之權利或違法時，應自負法律責任；並同意您所提供之個人資料不實或個人資料有異動但沒有更新以致於與原登錄之資料不符時，本遊戲有權隨時終止您的會員資格及使用各項會員服務之權利。'
          },
          {
            title:'四、服務之停止與更改：',
            content:'1.會員登錄之資料不實。\n2.使用他人的名義申請本服務。\n3.違反遊戲公平原則。\n4.參與遊戲或比賽時，故意鑽研系統漏洞或利用遊戲弱點以影響結果。\n5. 本遊戲不允許不公平的下注方式、雙邊下注、無風險下注及任何無風險解凍之下注方式，如有發現上述問題之玩家，本遊戲 有終止玩家帳號使用之權利。如有任何爭議問題，本遊戲有最終決定權。無論任何情形，就停止或更改服務或終止會員帳戶服務所可能產生之困擾、不便或損害，本遊戲對任何會員或第三人均不負任何責任。\n6. 本遊戲會員最多可申請 1 個帳號投注，若超過 1 個以上的帳號投注同場賽事，本游戲將保留最終的注單審核及刪除權利。'
          },
          {
            title:'五、服務暫停或中斷：',
            content:'(一) 本遊戲於下列情形之一時，對於使用者不負擔任何賠償責任：\n1.對於本遊戲相關系統設備進行遷移、更換或維護時。\n2.因不可歸責於本遊戲所造成服務停止或中斷。\n3.因不可抗力所造成服務停止或中斷。\n(二)如因本遊戲對於相關系統設備進行遷移、更換或維護而必須暫停或中斷服務時，將於本遊戲公告。\n(三)對於本遊戲之暫停或中斷，可能造成您使用上的不便、資料遺失或其他經濟及時間上之損失，您平時應採取適當的防護措施，以保障您的權益。'
          },
          {
            title:'六、保管義務：',
            content:'會員有義務妥善保管在本遊戲之帳號與密碼，並為此組帳號與密碼登入系統後所進行之一切活動負責。為維護會員自身權益，請勿將帳號與密碼洩露或提供予第三人知悉，或出借或轉讓他人使用。'
          },
          {
            title:'七、同意各項球賽及遊戲規則：',
            content:'為避免使用者於本遊戲平台投注球賽或遊戲時產生爭議，各項規則於遊戲中心和球賽中心均有詳細說明，請務必詳細閱讀本遊戲所定之各項規則，會員一經開始使用本遊戲，即被視為已接受所有之規定。'
          },
          {
            title:'八、會員規範之增訂及修改：',
            content:'本遊戲條款如有增訂或修改，您同意自該修訂條款於本遊戲網站公告之時起受其拘束，本遊戲網站將不對會員個別通知。如您於公告後繼續使用本遊戲，則視為您已經同意該修訂條款。'
          },
          {
            title:'九、隱私權聲明：',
            content:'我們致力為客戶保護隱私並提供一個最安全的遊戲平臺，我們在此網站搜集的資料將會為您提供最卓越的服務，我們不會出賣或租賃您的個人資料給第三方，客戶所提供的個人資料均經過加密技術處理，並儲存在安全的、非公開的作業系統，對於有機會接觸客戶的個人資料的協助夥伴也必需遵守我們訂立的隱私保密規則。'
          },
          {
            title:'十、免責聲明：',
            content:'部份地區或國家法律尚未明定線上博彩的合法性問題，甚至某些地區或國家已明確規範線上博彩為非法行為。我們無意邀請任何人在這些地區或國家非法使用本遊戲平台。使用者必需確定在您所居住的地區或國家使用線上博彩是否合法，並負完全的責任，使用本遊戲之會員請遵守使用者當地法令之許可，如有違反之情事恕非本遊戲之負責範圍。'
          },
        ],
      },
      announcement2:{
        checked:false,
        content:[
          {
            title:'敬愛的玩家您好',
            content:'1．視訊遊戲中如遇<span>遊戲牌組辨識錯誤</span>;或<span>荷官操作失誤</span>致使以錯誤結果計算時，本局押分<span>視為有效</span>，並且遊戲結果依現場牌型為依據作為正確結果重新計算。'
          },
          {
            title:'',
            content:'2．因不可歸責本遊戲或不可抗力因素所造成之<span>遊戲停止</span>或<span>中斷</span>，此局將不予計分予以<span>退分作為處理</span>。'
          },
          {
            title:'',
            content:'3．遊戲中如遇玩家網路不穩造成<span>瞬斷</span>或<span>視訊畫面延遲</span>時，玩家可以選譯停止下注或退出遊戲重新登入，如已押分仍<span>視為有效</span>。'
          },
          {
            title:'',
            content:'4．遊戲中荷官<span>不填同時抽出兩張牌</span>，無論辨識與否，荷官都將依正確順序辨識後繼續運行，當局繼續。下一局依照順序發牌，不得有議。'
          },
          {
            title:'',
            content:'5．當洗牌途中牌不慎<span>掉落／散開</span>，當局重新更換整副新牌並且重新洗牌。'
          },
          {
            title:'',
            content:'6．當牌局出現<span>鬼牌</span>或<span>白牌</span>時，當局和局，派彩後退回所有下注，重啟新局重新洗牌。'
          },
          {
            title:'',
            content:'7．發生<span>不當補牌／不當亮牌</span>時，當局正常輸贏，已亮之牌為下一局閒家第一張牌，下局以飛牌處理不接受投注。'
          },
          {
            title:'',
            content:'8．出<span>白卡</span>若當局補牌有過<span>白卡</span>，則當局為最後一局；若當局無過白卡，則當局結束後尚有下一局。'
          },
          // {
          //   title:'',
          //   content:'12．當荷官燒牌進行時不慎拉出兩張或三張陰牌，由監牌人員指示依順序放於畫面中，此陰牌則為下局閒家第一張牌開始發牌，若荷官燒牌張數未正確並已截圖送出，則整副牌組做廢並重新洗牌。'
          // },
          {
            title:'',
            content:'9．若荷官不慎在停止下注前亮牌，派彩後退回所有下注，不得有議。'
          },
          // {
          //   title:'',
          //   content:'13．如遇荷官勝負牌放置錯誤導致派彩結果錯誤，本公司有權重新派彩，不得異議。'
          // },
        ]
      },
      announcement3:{
        checked:false,
        content:[
          {
            title:'百家樂遊戲牌例',
            content:'',
            // img:require('../images/poker-sample.webp'),s
          }
        ]
      },
    },
    showannouncement:false,
  };
  export const actions = {}
  
  export const mutations = {
    BroadcastAnnouncement(state:any, payload:any) { //接收wbSocket的訊息
      state.BroadcastAnnouncement = payload
    },
    setShowannouncement(state:any, showOrnot:boolean){
      state.showannouncement = showOrnot
    },
    setAnnouncement1Checked(state:any,checked:boolean){
      state.announcement.announcement1 = checked
    },
    setAnnouncement2Checked(state:any,checked:boolean){
      state.announcement.announcement2 = checked
    },
    setAnnouncement3Checked(state:any,checked:boolean){
      state.announcement.announcement3 = checked
    },
  };
  export const getters = {}
  
  export default {
    state,
    actions,
    mutations,
    getters,
    namespaced: true,
  };